Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/include/pic32ck2051gc00100.h
/* ************************************************************************** */
/*  Event User IDs for C32CK2051GC00100 */
/* ************************************************************************** */
#define EVENT_ID_USER_FREQM_START                         0 /* ID for FREQM event user START */
#define EVENT_ID_USER_RTC_TAMPER                          1 /* ID for RTC event user TAMPER */
#define EVENT_ID_USER_PORT_EV_0                           2 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           3 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           4 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           5 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMA0_CHSTRT_0                       6 /* ID for DMA0 event user CHSTRT_0 */
#define EVENT_ID_USER_DMA0_CHSTRT_1                       7 /* ID for DMA0 event user CHSTRT_1 */
#define EVENT_ID_USER_DMA0_CHSTRT_2                       8 /* ID for DMA0 event user CHSTRT_2 */
#define EVENT_ID_USER_DMA0_CHSTRT_3                       9 /* ID for DMA0 event user CHSTRT_3 */
#define EVENT_ID_USER_DMA0_CHSTRT_4                      10 /* ID for DMA0 event user CHSTRT_4 */
#define EVENT_ID_USER_DMA0_CHSTRT_5                      11 /* ID for DMA0 event user CHSTRT_5 */
#define EVENT_ID_USER_DMA0_CHSTRT_6                      12 /* ID for DMA0 event user CHSTRT_6 */
#define EVENT_ID_USER_DMA0_CHSTRT_7                      13 /* ID for DMA0 event user CHSTRT_7 */
#define EVENT_ID_USER_DMA0_CHAUX_0                       14 /* ID for DMA0 event user CHAUX_0 */
#define EVENT_ID_USER_DMA0_CHAUX_1                       15 /* ID for DMA0 event user CHAUX_1 */
#define EVENT_ID_USER_DMA0_CHAUX_2                       16 /* ID for DMA0 event user CHAUX_2 */
#define EVENT_ID_USER_DMA0_CHAUX_3                       17 /* ID for DMA0 event user CHAUX_3 */
#define EVENT_ID_USER_DMA0_CHAUX_4                       18 /* ID for DMA0 event user CHAUX_4 */
#define EVENT_ID_USER_DMA0_CHAUX_5                       19 /* ID for DMA0 event user CHAUX_5 */
#define EVENT_ID_USER_DMA0_CHAUX_6                       20 /* ID for DMA0 event user CHAUX_6 */
#define EVENT_ID_USER_DMA0_CHAUX_7                       21 /* ID for DMA0 event user CHAUX_7 */
#define EVENT_ID_USER_DMA1_CHSTRT_0                      22 /* ID for DMA1 event user CHSTRT_0 */
#define EVENT_ID_USER_DMA1_CHSTRT_1                      23 /* ID for DMA1 event user CHSTRT_1 */
#define EVENT_ID_USER_DMA1_CHSTRT_2                      24 /* ID for DMA1 event user CHSTRT_2 */
#define EVENT_ID_USER_DMA1_CHSTRT_3                      25 /* ID for DMA1 event user CHSTRT_3 */
#define EVENT_ID_USER_DMA1_CHAUX_0                       26 /* ID for DMA1 event user CHAUX_0 */
#define EVENT_ID_USER_DMA1_CHAUX_1                       27 /* ID for DMA1 event user CHAUX_1 */
#define EVENT_ID_USER_DMA1_CHAUX_2                       28 /* ID for DMA1 event user CHAUX_2 */
#define EVENT_ID_USER_DMA1_CHAUX_3                       29 /* ID for DMA1 event user CHAUX_3 */
#define EVENT_ID_USER_TCC0_EV_0                          30 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          31 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC0                           32 /* ID for TCC0 event user MC0 */
#define EVENT_ID_USER_TCC0_MC1                           33 /* ID for TCC0 event user MC1 */
#define EVENT_ID_USER_TCC0_MC2                           34 /* ID for TCC0 event user MC2 */
#define EVENT_ID_USER_TCC0_MC3                           35 /* ID for TCC0 event user MC3 */
#define EVENT_ID_USER_TCC0_MC4                           36 /* ID for TCC0 event user MC4 */
#define EVENT_ID_USER_TCC0_MC5                           37 /* ID for TCC0 event user MC5 */
#define EVENT_ID_USER_TCC1_EV_0                          38 /* ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          39 /* ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC0                           40 /* ID for TCC1 event user MC0 */
#define EVENT_ID_USER_TCC1_MC1                           41 /* ID for TCC1 event user MC1 */
#define EVENT_ID_USER_TCC1_MC2                           42 /* ID for TCC1 event user MC2 */
#define EVENT_ID_USER_TCC1_MC3                           43 /* ID for TCC1 event user MC3 */
#define EVENT_ID_USER_TCC1_MC4                           44 /* ID for TCC1 event user MC4 */
#define EVENT_ID_USER_TCC1_MC5                           45 /* ID for TCC1 event user MC5 */
#define EVENT_ID_USER_TCC2_EV_0                          46 /* ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          47 /* ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC0                           48 /* ID for TCC2 event user MC0 */
#define EVENT_ID_USER_TCC2_MC1                           49 /* ID for TCC2 event user MC1 */
#define EVENT_ID_USER_TCC2_MC2                           50 /* ID for TCC2 event user MC2 */
#define EVENT_ID_USER_TCC2_MC3                           51 /* ID for TCC2 event user MC3 */
#define EVENT_ID_USER_TCC2_MC4                           52 /* ID for TCC2 event user MC4 */
#define EVENT_ID_USER_TCC2_MC5                           53 /* ID for TCC2 event user MC5 */
#define EVENT_ID_USER_TCC3_EV_0                          54 /* ID for TCC3 event user EV_0 */
#define EVENT_ID_USER_TCC3_EV_1                          55 /* ID for TCC3 event user EV_1 */
#define EVENT_ID_USER_TCC3_MC0                           56 /* ID for TCC3 event user MC0 */
#define EVENT_ID_USER_TCC3_MC1                           57 /* ID for TCC3 event user MC1 */
#define EVENT_ID_USER_TCC3_MC2                           58 /* ID for TCC3 event user MC2 */
#define EVENT_ID_USER_TCC3_MC3                           59 /* ID for TCC3 event user MC3 */
#define EVENT_ID_USER_TCC3_MC4                           60 /* ID for TCC3 event user MC4 */
#define EVENT_ID_USER_TCC3_MC5                           61 /* ID for TCC3 event user MC5 */
#define EVENT_ID_USER_TCC4_EV_0                          62 /* ID for TCC4 event user EV_0 */
#define EVENT_ID_USER_TCC4_EV_1                          63 /* ID for TCC4 event user EV_1 */
#define EVENT_ID_USER_TCC4_MC0                           64 /* ID for TCC4 event user MC0 */
#define EVENT_ID_USER_TCC4_MC1                           65 /* ID for TCC4 event user MC1 */
#define EVENT_ID_USER_TCC5_EV_0                          66 /* ID for TCC5 event user EV_0 */
#define EVENT_ID_USER_TCC5_EV_1                          67 /* ID for TCC5 event user EV_1 */
#define EVENT_ID_USER_TCC5_MC0                           68 /* ID for TCC5 event user MC0 */
#define EVENT_ID_USER_TCC5_MC1                           69 /* ID for TCC5 event user MC1 */
#define EVENT_ID_USER_TCC6_EV_0                          70 /* ID for TCC6 event user EV_0 */
#define EVENT_ID_USER_TCC6_EV_1                          71 /* ID for TCC6 event user EV_1 */
#define EVENT_ID_USER_TCC6_MC0                           72 /* ID for TCC6 event user MC0 */
#define EVENT_ID_USER_TCC6_MC1                           73 /* ID for TCC6 event user MC1 */
#define EVENT_ID_USER_TCC7_EV_0                          74 /* ID for TCC7 event user EV_0 */
#define EVENT_ID_USER_TCC7_EV_1                          75 /* ID for TCC7 event user EV_1 */
#define EVENT_ID_USER_TCC7_MC0                           76 /* ID for TCC7 event user MC0 */
#define EVENT_ID_USER_TCC7_MC1                           77 /* ID for TCC7 event user MC1 */
#define EVENT_ID_USER_ADC_TRIGGERS_0                     78 /* ID for ADC event user TRIGGERS_0 */
#define EVENT_ID_USER_ADC_TRIGGERS_1                     79 /* ID for ADC event user TRIGGERS_1 */
#define EVENT_ID_USER_ADC_TRIGGERS_2                     80 /* ID for ADC event user TRIGGERS_2 */
#define EVENT_ID_USER_ADC_TRIGGERS_3                     81 /* ID for ADC event user TRIGGERS_3 */
#define EVENT_ID_USER_ADC_TRIGGERS_4                     82 /* ID for ADC event user TRIGGERS_4 */
#define EVENT_ID_USER_ADC_TRIGGERS_5                     83 /* ID for ADC event user TRIGGERS_5 */
#define EVENT_ID_USER_ADC_TRIGGERS_6                     84 /* ID for ADC event user TRIGGERS_6 */
#define EVENT_ID_USER_ADC_TRIGGERS_7                     85 /* ID for ADC event user TRIGGERS_7 */
#define EVENT_ID_USER_ADC_TRIGGERS_8                     86 /* ID for ADC event user TRIGGERS_8 */
#define EVENT_ID_USER_ADC_TRIGGERS_9                     87 /* ID for ADC event user TRIGGERS_9 */
#define EVENT_ID_USER_ADC_TRIGGERS_10                    88 /* ID for ADC event user TRIGGERS_10 */
#define EVENT_ID_USER_AC_SOC_0                           89 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           90 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_CCL_LUTIN_0                        93 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        94 /* ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CCL_LUTIN_2                        95 /* ID for CCL event user LUTIN_2 */
#define EVENT_ID_USER_CCL_LUTIN_3                        96 /* ID for CCL event user LUTIN_3 */
#define EVENT_ID_USER_PDEC_EVU_0                         97 /* ID for PDEC event user EVU_0 */
#define EVENT_ID_USER_PDEC_EVU_1                         98 /* ID for PDEC event user EVU_1 */
#define EVENT_ID_USER_PDEC_EVU_2                         99 /* ID for PDEC event user EVU_2 */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CK2051GC00100_H_ */

